In [20]:
import pandas as pd
import numpy as np
data = pd.read_csv("customers.csv")
df = pd.DataFrame(data)
df

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0          NaN
3           4    David   NaN      Chicago
4           5      Eve  45.0      Houston

In [21]:
df.columns

Index(['CustomerID', 'Name', 'Age', 'City'], dtype='object')

In [22]:
df.head()

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0          NaN
3           4    David   NaN      Chicago
4           5      Eve  45.0      Houston

In [23]:
df.tail()

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0          NaN
3           4    David   NaN      Chicago
4           5      Eve  45.0      Houston

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerID  5 non-null      int64
 1   Name        5 non-null      object
 2   Age         4 non-null      float64
 3   City        4 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 292.0+ bytes

In [25]:
df.describe()

       CustomerID        Age
count    5.000000   4.000000
mean     3.000000  33.750000
std      1.581139   8.539126
min      1.000000  25.000000
25%      2.000000  28.750000
50%      3.000000  32.500000
75%      4.000000  37.500000
max      5.000000  45.000000

In [26]:
np.shape(df)

(5, 4)

In [27]:
df['Age'].fillna(df['Age'],inplace=True)
df

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0          NaN
3           4    David   NaN      Chicago
4           5      Eve  45.0      Houston

In [28]:
type[df['Name']]

type[0      Alice
1        Bob
2    Charlie
3      David
4        Eve
Name: Name, dtype: object]

In [29]:
np.median(df['Age'])

nan

In [30]:
df2 = pd.DataFrame({'CustomerID': [1 ,2, 5], 'Profession': ['Lawyer', 'Scientist', 'Teacher']})
merdf = pd.merge(df, df2, on='CustomerID')
merdf

   CustomerID   Name   Age         City Profession
0           1  Alice  25.0     New York     Lawyer
1           2    Bob  30.0  Los Angeles  Scientist
2           5    Eve  45.0      Houston    Teacher

In [31]:
np.concatenate([df['Name'].values, df['CustomerID'].values])

array(['Alice', 'Bob', 'Charlie', 'David', 'Eve', 1, 2, 3, 4, 5],
      dtype=object)

In [32]:
newdf=df.fillna({
    'Age':70})
newdf

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0          NaN
3           4    David  70.0      Chicago
4           5      Eve  45.0      Houston

In [33]:
newdf=df.fillna(method='ffill') #bfill
newdf

C:\Users\laxmi\AppData\Local\Temp\ipykernel_9536\1160583232.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  newdf=df.fillna(method='ffill') #bfill

   CustomerID     Name   Age         City
0           1    Alice  25.0     New York
1           2      Bob  30.0  Los Angeles
2           3  Charlie  35.0  Los Angeles
3           4    David  35.0      Chicago
4           5      Eve  45.0      Houston

In [34]:
grpdf=newdf.groupby("CustomerID")
grpdf